app/controllers/gists_controller.rb

  def index
      @gists = Gist.search(params[:search]).paginate(page: params[:page], per_page: 10).order('created_at DESC')
---
SELECT  "gists".* FROM "gists"  WHERE (description LIKE '%Te%')  ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "gists"  WHERE (description LIKE '%d%')

  def create
    @gist = Gist.new(gist_params)

    respond_to do |format|
      if @gist.save
---
INSERT INTO "gists" ("created_at", "description", "lang", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-04-02 17:58:36.978640"], ["description", ""], ["lang", "abap"], ["snippet", ""], ["updated_at", "2014-04-02 17:58:36.978640"]]

  def update
    respond_to do |format|
      if @gist.update(gist_params)
---
UPDATE "gists" SET "snippet" = ?, "updated_at" = ? WHERE "gists"."id" = 83  [["snippet", "\r\nclass HelloWorld {\r\n  static public void main( String args[] ) {\r\n    System.out.println( \"Hello World!\" );\r\n  }\r\n}\r\n"], ["updated_at", "2014-05-13 13:03:40.307604"]]

  def destroy
    @gist.destroy
---
DELETE FROM "gists" WHERE "gists"."id" = ?  [["id", 1]]